/* automatically generated by rust-bindgen 0.68.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const NGX_MAIL_AUTH_LOGIN_ENABLED: u32 = 4;
pub const NGX_MAIL_AUTH_APOP_ENABLED: u32 = 8;
pub const NGX_MAIL_AUTH_CRAM_MD5_ENABLED: u32 = 16;
pub const NGX_MAIL_AUTH_EXTERNAL_ENABLED: u32 = 32;
pub const NGX_MAIL_AUTH_NONE_ENABLED: u32 = 64;
pub const NGX_MAIL_PARSE_INVALID_COMMAND: u32 = 20;
pub const NGX_MAIL_MODULE: u32 = 1279869261;
pub const NGX_MAIL_MAIN_CONF: u32 = 33554432;
pub const NGX_MAIL_SRV_CONF: u32 = 67108864;
pub const NGX_STREAM_VAR_CHANGEABLE: u32 = 1;
pub const NGX_STREAM_VAR_NOCACHEABLE: u32 = 2;
pub const NGX_STREAM_VAR_INDEXED: u32 = 4;
pub const NGX_STREAM_VAR_NOHASH: u32 = 8;
pub const NGX_STREAM_VAR_WEAK: u32 = 16;
pub const NGX_STREAM_VAR_PREFIX: u32 = 32;
pub const NGX_STREAM_UPSTREAM_CREATE: u32 = 1;
pub const NGX_STREAM_UPSTREAM_WEIGHT: u32 = 2;
pub const NGX_STREAM_UPSTREAM_MAX_FAILS: u32 = 4;
pub const NGX_STREAM_UPSTREAM_FAIL_TIMEOUT: u32 = 8;
pub const NGX_STREAM_UPSTREAM_DOWN: u32 = 16;
pub const NGX_STREAM_UPSTREAM_BACKUP: u32 = 32;
pub const NGX_STREAM_UPSTREAM_MAX_CONNS: u32 = 256;
pub const NGX_STREAM_UPSTREAM_NOTIFY_CONNECT: u32 = 1;
pub const NGX_STREAM_OK: u32 = 200;
pub const NGX_STREAM_BAD_REQUEST: u32 = 400;
pub const NGX_STREAM_FORBIDDEN: u32 = 403;
pub const NGX_STREAM_INTERNAL_SERVER_ERROR: u32 = 500;
pub const NGX_STREAM_BAD_GATEWAY: u32 = 502;
pub const NGX_STREAM_SERVICE_UNAVAILABLE: u32 = 503;
pub const NGX_STREAM_MODULE: u32 = 1297241171;
pub const NGX_STREAM_MAIN_CONF: u32 = 33554432;
pub const NGX_STREAM_SRV_CONF: u32 = 67108864;
pub const NGX_STREAM_UPS_CONF: u32 = 134217728;
pub const NGX_STREAM_WRITE_BUFFERED: u32 = 16;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __time_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type ino_t = __ino64_t;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off64_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type socklen_t = __socklen_t;
pub type va_list = __builtin_va_list;
pub type sig_atomic_t = __sig_atomic_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirent {
    pub d_ino: __ino64_t,
    pub d_off: __off64_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_dirent() {
    const UNINIT: ::std::mem::MaybeUninit<dirent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dirent>(),
        280usize,
        concat!("Size of: ", stringify!(dirent))
    );
    assert_eq!(
        ::std::mem::align_of::<dirent>(),
        8usize,
        concat!("Alignment of ", stringify!(dirent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ino) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_off) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_reclen) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_reclen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_type) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_name) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type __size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct glob_t {
    pub gl_pathc: __size_t,
    pub gl_pathv: *mut *mut ::std::os::raw::c_char,
    pub gl_offs: __size_t,
    pub gl_flags: ::std::os::raw::c_int,
    pub gl_closedir: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub gl_readdir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut dirent,
    >,
    pub gl_opendir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub gl_lstat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut stat,
        ) -> ::std::os::raw::c_int,
    >,
    pub gl_stat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut stat,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_glob_t() {
    const UNINIT: ::std::mem::MaybeUninit<glob_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<glob_t>(),
        72usize,
        concat!("Size of: ", stringify!(glob_t))
    );
    assert_eq!(
        ::std::mem::align_of::<glob_t>(),
        8usize,
        concat!("Alignment of ", stringify!(glob_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_pathc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_pathc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_pathv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_pathv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_offs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_closedir) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_closedir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_readdir) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_readdir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_opendir) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_opendir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_lstat) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_lstat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_stat) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_stat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    const UNINIT: ::std::mem::MaybeUninit<cpu_set_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(cpu_set_t))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_set_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_set_t),
            "::",
            stringify!(__bits)
        )
    );
}
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cmsg_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_ifindex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_spec_dst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub type in_port_t = u16;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__in6_u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_zero) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_flowinfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_scope_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_pktinfo {
    pub ipi6_addr: in6_addr,
    pub ipi6_ifindex: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_in6_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in6_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_pktinfo>(),
        20usize,
        concat!("Size of: ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi6_ifindex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_un {
    pub sun_family: sa_family_t,
    pub sun_path: [::std::os::raw::c_char; 108usize],
}
#[test]
fn bindgen_test_layout_sockaddr_un() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_un> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_un>(),
        110usize,
        concat!("Size of: ", stringify!(sockaddr_un))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_un>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr_un))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sun_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_un),
            "::",
            stringify!(sun_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sun_path) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_un),
            "::",
            stringify!(sun_path)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sem_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_sem_t() {
    const UNINIT: ::std::mem::MaybeUninit<sem_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sem_t>(),
        32usize,
        concat!("Size of: ", stringify!(sem_t))
    );
    assert_eq!(
        ::std::mem::align_of::<sem_t>(),
        8usize,
        concat!("Alignment of ", stringify!(sem_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sem_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sem_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type ngx_int_t = isize;
pub type ngx_uint_t = usize;
pub type ngx_flag_t = isize;
pub type ngx_module_t = ngx_module_s;
pub type ngx_conf_t = ngx_conf_s;
pub type ngx_cycle_t = ngx_cycle_s;
pub type ngx_pool_t = ngx_pool_s;
pub type ngx_chain_t = ngx_chain_s;
pub type ngx_log_t = ngx_log_s;
pub type ngx_open_file_t = ngx_open_file_s;
pub type ngx_command_t = ngx_command_s;
pub type ngx_file_t = ngx_file_s;
pub type ngx_event_t = ngx_event_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_event_aio_s {
    _unused: [u8; 0],
}
pub type ngx_event_aio_t = ngx_event_aio_s;
pub type ngx_connection_t = ngx_connection_s;
pub type ngx_thread_task_t = ngx_thread_task_s;
pub type ngx_ssl_t = ngx_ssl_s;
pub type ngx_proxy_protocol_t = ngx_proxy_protocol_s;
pub type ngx_ssl_connection_t = ngx_ssl_connection_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_udp_connection_s {
    _unused: [u8; 0],
}
pub type ngx_udp_connection_t = ngx_udp_connection_s;
pub type ngx_event_handler_pt = ::std::option::Option<unsafe extern "C" fn(ev: *mut ngx_event_t)>;
pub type ngx_connection_handler_pt =
    ::std::option::Option<unsafe extern "C" fn(c: *mut ngx_connection_t)>;
pub type ngx_err_t = ::std::os::raw::c_int;
extern "C" {
    pub fn ngx_strerror(err: ngx_err_t, errstr: *mut u_char, size: usize) -> *mut u_char;
}
extern "C" {
    pub fn ngx_strerror_init() -> ngx_int_t;
}
pub type ngx_atomic_int_t = ::std::os::raw::c_long;
pub type ngx_atomic_uint_t = ::std::os::raw::c_ulong;
pub type ngx_atomic_t = ngx_atomic_uint_t;
extern "C" {
    pub fn ngx_spinlock(lock: *mut ngx_atomic_t, value: ngx_atomic_int_t, spin: ngx_uint_t);
}
pub type ngx_thread_mutex_t = pthread_mutex_t;
extern "C" {
    pub fn ngx_thread_mutex_create(mtx: *mut ngx_thread_mutex_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_mutex_destroy(mtx: *mut ngx_thread_mutex_t, log: *mut ngx_log_t)
        -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_mutex_lock(mtx: *mut ngx_thread_mutex_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_mutex_unlock(mtx: *mut ngx_thread_mutex_t, log: *mut ngx_log_t) -> ngx_int_t;
}
pub type ngx_thread_cond_t = pthread_cond_t;
extern "C" {
    pub fn ngx_thread_cond_create(cond: *mut ngx_thread_cond_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_cond_destroy(cond: *mut ngx_thread_cond_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_cond_signal(cond: *mut ngx_thread_cond_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_thread_cond_wait(
        cond: *mut ngx_thread_cond_t,
        mtx: *mut ngx_thread_mutex_t,
        log: *mut ngx_log_t,
    ) -> ngx_int_t;
}
pub type ngx_tid_t = pid_t;
extern "C" {
    pub fn ngx_thread_tid() -> ngx_tid_t;
}
pub type ngx_rbtree_key_t = ngx_uint_t;
pub type ngx_rbtree_key_int_t = ngx_int_t;
pub type ngx_rbtree_node_t = ngx_rbtree_node_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_rbtree_node_s {
    pub key: ngx_rbtree_key_t,
    pub left: *mut ngx_rbtree_node_t,
    pub right: *mut ngx_rbtree_node_t,
    pub parent: *mut ngx_rbtree_node_t,
    pub color: u_char,
    pub data: u_char,
}
#[test]
fn bindgen_test_layout_ngx_rbtree_node_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_rbtree_node_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_rbtree_node_s>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_rbtree_node_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_rbtree_node_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_rbtree_node_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_node_s),
            "::",
            stringify!(data)
        )
    );
}
pub type ngx_rbtree_t = ngx_rbtree_s;
pub type ngx_rbtree_insert_pt = ::std::option::Option<
    unsafe extern "C" fn(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_rbtree_s {
    pub root: *mut ngx_rbtree_node_t,
    pub sentinel: *mut ngx_rbtree_node_t,
    pub insert: ngx_rbtree_insert_pt,
}
#[test]
fn bindgen_test_layout_ngx_rbtree_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_rbtree_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_rbtree_s>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_rbtree_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_rbtree_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_rbtree_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_s),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sentinel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_s),
            "::",
            stringify!(sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).insert) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_rbtree_s),
            "::",
            stringify!(insert)
        )
    );
}
extern "C" {
    pub fn ngx_rbtree_insert(tree: *mut ngx_rbtree_t, node: *mut ngx_rbtree_node_t);
}
extern "C" {
    pub fn ngx_rbtree_delete(tree: *mut ngx_rbtree_t, node: *mut ngx_rbtree_node_t);
}
extern "C" {
    pub fn ngx_rbtree_insert_value(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
extern "C" {
    pub fn ngx_rbtree_insert_timer_value(
        root: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
extern "C" {
    pub fn ngx_rbtree_next(
        tree: *mut ngx_rbtree_t,
        node: *mut ngx_rbtree_node_t,
    ) -> *mut ngx_rbtree_node_t;
}
pub type ngx_msec_t = ngx_rbtree_key_t;
pub type ngx_msec_int_t = ngx_rbtree_key_int_t;
pub type ngx_tm_t = tm;
extern "C" {
    pub fn ngx_timezone_update();
}
extern "C" {
    pub fn ngx_localtime(s: time_t, tm: *mut ngx_tm_t);
}
extern "C" {
    pub fn ngx_libc_localtime(s: time_t, tm: *mut tm);
}
extern "C" {
    pub fn ngx_libc_gmtime(s: time_t, tm: *mut tm);
}
pub type ngx_socket_t = ::std::os::raw::c_int;
extern "C" {
    pub fn ngx_nonblocking(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ngx_blocking(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ngx_tcp_nopush(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ngx_tcp_push(s: ngx_socket_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_str_t {
    pub len: usize,
    pub data: *mut u_char,
}
#[test]
fn bindgen_test_layout_ngx_str_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_str_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_str_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_str_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_str_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_str_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_str_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_str_t),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_keyval_t {
    pub key: ngx_str_t,
    pub value: ngx_str_t,
}
#[test]
fn bindgen_test_layout_ngx_keyval_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_keyval_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_keyval_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_keyval_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_keyval_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_keyval_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_keyval_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_keyval_t),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_variable_value_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub data: *mut u_char,
}
#[test]
fn bindgen_test_layout_ngx_variable_value_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_variable_value_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_variable_value_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_variable_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_variable_value_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_variable_value_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_variable_value_t),
            "::",
            stringify!(data)
        )
    );
}
impl ngx_variable_value_t {
    #[inline]
    pub fn len(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_len(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub fn valid(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn no_cacheable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_cacheable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn not_found(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_not_found(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn escape(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_escape(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        len: ::std::os::raw::c_uint,
        valid: ::std::os::raw::c_uint,
        no_cacheable: ::std::os::raw::c_uint,
        not_found: ::std::os::raw::c_uint,
        escape: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 28u8, {
            let len: u32 = unsafe { ::std::mem::transmute(len) };
            len as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let valid: u32 = unsafe { ::std::mem::transmute(valid) };
            valid as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let no_cacheable: u32 = unsafe { ::std::mem::transmute(no_cacheable) };
            no_cacheable as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let not_found: u32 = unsafe { ::std::mem::transmute(not_found) };
            not_found as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let escape: u32 = unsafe { ::std::mem::transmute(escape) };
            escape as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ngx_strlow(dst: *mut u_char, src: *mut u_char, n: usize);
}
extern "C" {
    pub fn ngx_strnlen(p: *mut u_char, n: usize) -> usize;
}
extern "C" {
    pub fn ngx_explicit_memzero(buf: *mut ::std::os::raw::c_void, n: usize);
}
extern "C" {
    pub fn ngx_cpystrn(dst: *mut u_char, src: *mut u_char, n: usize) -> *mut u_char;
}
extern "C" {
    pub fn ngx_pstrdup(pool: *mut ngx_pool_t, src: *mut ngx_str_t) -> *mut u_char;
}
extern "C" {
    pub fn ngx_sprintf(buf: *mut u_char, fmt: *const ::std::os::raw::c_char, ...) -> *mut u_char;
}
extern "C" {
    pub fn ngx_snprintf(
        buf: *mut u_char,
        max: usize,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_slprintf(
        buf: *mut u_char,
        last: *mut u_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_vslprintf(
        buf: *mut u_char,
        last: *mut u_char,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_strcasecmp(s1: *mut u_char, s2: *mut u_char) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_strncasecmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_strnstr(s1: *mut u_char, s2: *mut ::std::os::raw::c_char, n: usize) -> *mut u_char;
}
extern "C" {
    pub fn ngx_strstrn(s1: *mut u_char, s2: *mut ::std::os::raw::c_char, n: usize) -> *mut u_char;
}
extern "C" {
    pub fn ngx_strcasestrn(
        s1: *mut u_char,
        s2: *mut ::std::os::raw::c_char,
        n: usize,
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_strlcasestrn(
        s1: *mut u_char,
        last: *mut u_char,
        s2: *mut u_char,
        n: usize,
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_rstrncmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_rstrncasecmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_memn2cmp(s1: *mut u_char, s2: *mut u_char, n1: usize, n2: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_dns_strcmp(s1: *mut u_char, s2: *mut u_char) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_filename_cmp(s1: *mut u_char, s2: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_atoi(line: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_atofp(line: *mut u_char, n: usize, point: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_atosz(line: *mut u_char, n: usize) -> isize;
}
extern "C" {
    pub fn ngx_atoof(line: *mut u_char, n: usize) -> off_t;
}
extern "C" {
    pub fn ngx_atotm(line: *mut u_char, n: usize) -> time_t;
}
extern "C" {
    pub fn ngx_hextoi(line: *mut u_char, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_hex_dump(dst: *mut u_char, src: *mut u_char, len: usize) -> *mut u_char;
}
extern "C" {
    pub fn ngx_encode_base64(dst: *mut ngx_str_t, src: *mut ngx_str_t);
}
extern "C" {
    pub fn ngx_encode_base64url(dst: *mut ngx_str_t, src: *mut ngx_str_t);
}
extern "C" {
    pub fn ngx_decode_base64(dst: *mut ngx_str_t, src: *mut ngx_str_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_decode_base64url(dst: *mut ngx_str_t, src: *mut ngx_str_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_utf8_decode(p: *mut *mut u_char, n: usize) -> u32;
}
extern "C" {
    pub fn ngx_utf8_length(p: *mut u_char, n: usize) -> usize;
}
extern "C" {
    pub fn ngx_utf8_cpystrn(
        dst: *mut u_char,
        src: *mut u_char,
        n: usize,
        len: usize,
    ) -> *mut u_char;
}
extern "C" {
    pub fn ngx_escape_uri(
        dst: *mut u_char,
        src: *mut u_char,
        size: usize,
        type_: ngx_uint_t,
    ) -> usize;
}
extern "C" {
    pub fn ngx_unescape_uri(
        dst: *mut *mut u_char,
        src: *mut *mut u_char,
        size: usize,
        type_: ngx_uint_t,
    );
}
extern "C" {
    pub fn ngx_escape_html(dst: *mut u_char, src: *mut u_char, size: usize) -> usize;
}
extern "C" {
    pub fn ngx_escape_json(dst: *mut u_char, src: *mut u_char, size: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_str_node_t {
    pub node: ngx_rbtree_node_t,
    pub str_: ngx_str_t,
}
#[test]
fn bindgen_test_layout_ngx_str_node_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_str_node_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_str_node_t>(),
        56usize,
        concat!("Size of: ", stringify!(ngx_str_node_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_str_node_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_str_node_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_str_node_t),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_str_node_t),
            "::",
            stringify!(str_)
        )
    );
}
extern "C" {
    pub fn ngx_str_rbtree_insert_value(
        temp: *mut ngx_rbtree_node_t,
        node: *mut ngx_rbtree_node_t,
        sentinel: *mut ngx_rbtree_node_t,
    );
}
extern "C" {
    pub fn ngx_str_rbtree_lookup(
        rbtree: *mut ngx_rbtree_t,
        name: *mut ngx_str_t,
        hash: u32,
    ) -> *mut ngx_str_node_t;
}
extern "C" {
    pub fn ngx_sort(
        base: *mut ::std::os::raw::c_void,
        n: usize,
        size: usize,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ngx_int_t,
        >,
    );
}
pub type ngx_fd_t = ::std::os::raw::c_int;
pub type ngx_file_info_t = stat;
pub type ngx_file_uniq_t = ino_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_file_mapping_t {
    pub name: *mut u_char,
    pub size: usize,
    pub addr: *mut ::std::os::raw::c_void,
    pub fd: ngx_fd_t,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_file_mapping_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_file_mapping_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_file_mapping_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_file_mapping_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_file_mapping_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_file_mapping_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_mapping_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_mapping_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_mapping_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_mapping_t),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_mapping_t),
            "::",
            stringify!(log)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_dir_t {
    pub dir: *mut DIR,
    pub de: *mut dirent,
    pub info: stat,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[test]
fn bindgen_test_layout_ngx_dir_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_dir_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_dir_t>(),
        168usize,
        concat!("Size of: ", stringify!(ngx_dir_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_dir_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_dir_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_dir_t),
            "::",
            stringify!(dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).de) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_dir_t),
            "::",
            stringify!(de)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_dir_t),
            "::",
            stringify!(info)
        )
    );
}
impl ngx_dir_t {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn valid_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        valid_info: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let valid_info: u32 = unsafe { ::std::mem::transmute(valid_info) };
            valid_info as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_glob_t {
    pub n: usize,
    pub pglob: glob_t,
    pub pattern: *mut u_char,
    pub log: *mut ngx_log_t,
    pub test: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_glob_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_glob_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_glob_t>(),
        104usize,
        concat!("Size of: ", stringify!(ngx_glob_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_glob_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_glob_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_glob_t),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pglob) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_glob_t),
            "::",
            stringify!(pglob)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pattern) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_glob_t),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_glob_t),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).test) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_glob_t),
            "::",
            stringify!(test)
        )
    );
}
extern "C" {
    pub fn ngx_open_tempfile(
        name: *mut u_char,
        persistent: ngx_uint_t,
        access: ngx_uint_t,
    ) -> ngx_fd_t;
}
extern "C" {
    pub fn ngx_read_file(
        file: *mut ngx_file_t,
        buf: *mut u_char,
        size: usize,
        offset: off_t,
    ) -> isize;
}
extern "C" {
    pub fn ngx_write_file(
        file: *mut ngx_file_t,
        buf: *mut u_char,
        size: usize,
        offset: off_t,
    ) -> isize;
}
extern "C" {
    pub fn ngx_write_chain_to_file(
        file: *mut ngx_file_t,
        ce: *mut ngx_chain_t,
        offset: off_t,
        pool: *mut ngx_pool_t,
    ) -> isize;
}
extern "C" {
    pub fn ngx_set_file_time(name: *mut u_char, fd: ngx_fd_t, s: time_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_create_file_mapping(fm: *mut ngx_file_mapping_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_close_file_mapping(fm: *mut ngx_file_mapping_t);
}
extern "C" {
    pub fn ngx_open_dir(name: *mut ngx_str_t, dir: *mut ngx_dir_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_read_dir(dir: *mut ngx_dir_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_open_glob(gl: *mut ngx_glob_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_read_glob(gl: *mut ngx_glob_t, name: *mut ngx_str_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_close_glob(gl: *mut ngx_glob_t);
}
extern "C" {
    pub fn ngx_trylock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
extern "C" {
    pub fn ngx_lock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
extern "C" {
    pub fn ngx_unlock_fd(fd: ngx_fd_t) -> ngx_err_t;
}
extern "C" {
    pub fn ngx_read_ahead(fd: ngx_fd_t, n: usize) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_directio_on(fd: ngx_fd_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_directio_off(fd: ngx_fd_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_fs_bsize(name: *mut u_char) -> usize;
}
extern "C" {
    pub fn ngx_fs_available(name: *mut u_char) -> off_t;
}
extern "C" {
    pub fn ngx_thread_read(
        file: *mut ngx_file_t,
        buf: *mut u_char,
        size: usize,
        offset: off_t,
        pool: *mut ngx_pool_t,
    ) -> isize;
}
extern "C" {
    pub fn ngx_thread_write_chain_to_file(
        file: *mut ngx_file_t,
        cl: *mut ngx_chain_t,
        offset: off_t,
        pool: *mut ngx_pool_t,
    ) -> isize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shm_t {
    pub addr: *mut u_char,
    pub size: usize,
    pub name: ngx_str_t,
    pub log: *mut ngx_log_t,
    pub exists: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_shm_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_shm_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_shm_t>(),
        48usize,
        concat!("Size of: ", stringify!(ngx_shm_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_shm_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_shm_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_t),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exists) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_t),
            "::",
            stringify!(exists)
        )
    );
}
extern "C" {
    pub fn ngx_shm_alloc(shm: *mut ngx_shm_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_shm_free(shm: *mut ngx_shm_t);
}
pub type ngx_cpuset_t = cpu_set_t;
extern "C" {
    pub fn ngx_setaffinity(cpu_affinity: *mut ngx_cpuset_t, log: *mut ngx_log_t);
}
extern "C" {
    pub fn ngx_init_setproctitle(log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_setproctitle(title: *mut ::std::os::raw::c_char);
}
pub type ngx_pid_t = pid_t;
pub type ngx_spawn_proc_pt = ::std::option::Option<
    unsafe extern "C" fn(cycle: *mut ngx_cycle_t, data: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_process_t {
    pub pid: ngx_pid_t,
    pub status: ::std::os::raw::c_int,
    pub channel: [ngx_socket_t; 2usize],
    pub proc_: ngx_spawn_proc_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub name: *mut ::std::os::raw::c_char,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_ngx_process_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_process_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_process_t>(),
        48usize,
        concat!("Size of: ", stringify!(ngx_process_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_process_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_process_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proc_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(proc_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_process_t),
            "::",
            stringify!(name)
        )
    );
}
impl ngx_process_t {
    #[inline]
    pub fn respawn(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_respawn(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn just_spawn(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_just_spawn(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn detached(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_detached(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn exiting(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_exiting(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn exited(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_exited(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        respawn: ::std::os::raw::c_uint,
        just_spawn: ::std::os::raw::c_uint,
        detached: ::std::os::raw::c_uint,
        exiting: ::std::os::raw::c_uint,
        exited: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let respawn: u32 = unsafe { ::std::mem::transmute(respawn) };
            respawn as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let just_spawn: u32 = unsafe { ::std::mem::transmute(just_spawn) };
            just_spawn as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let detached: u32 = unsafe { ::std::mem::transmute(detached) };
            detached as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let exiting: u32 = unsafe { ::std::mem::transmute(exiting) };
            exiting as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let exited: u32 = unsafe { ::std::mem::transmute(exited) };
            exited as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_exec_ctx_t {
    pub path: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub argv: *const *mut ::std::os::raw::c_char,
    pub envp: *const *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ngx_exec_ctx_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_exec_ctx_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_exec_ctx_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_exec_ctx_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_exec_ctx_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_exec_ctx_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_exec_ctx_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_exec_ctx_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argv) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_exec_ctx_t),
            "::",
            stringify!(argv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).envp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_exec_ctx_t),
            "::",
            stringify!(envp)
        )
    );
}
extern "C" {
    pub fn ngx_spawn_process(
        cycle: *mut ngx_cycle_t,
        proc_: ngx_spawn_proc_pt,
        data: *mut ::std::os::raw::c_void,
        name: *mut ::std::os::raw::c_char,
        respawn: ngx_int_t,
    ) -> ngx_pid_t;
}
extern "C" {
    pub fn ngx_execute(cycle: *mut ngx_cycle_t, ctx: *mut ngx_exec_ctx_t) -> ngx_pid_t;
}
extern "C" {
    pub fn ngx_init_signals(log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_debug_point();
}
extern "C" {
    pub static mut ngx_argc: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut ngx_argv: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut ngx_os_argv: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut ngx_pid: ngx_pid_t;
}
extern "C" {
    pub static mut ngx_parent: ngx_pid_t;
}
extern "C" {
    pub static mut ngx_channel: ngx_socket_t;
}
extern "C" {
    pub static mut ngx_process_slot: ngx_int_t;
}
extern "C" {
    pub static mut ngx_last_process: ngx_int_t;
}
extern "C" {
    pub static mut ngx_processes: [ngx_process_t; 1024usize];
}
pub type ngx_uid_t = uid_t;
pub type ngx_gid_t = gid_t;
extern "C" {
    pub fn ngx_libc_crypt(
        pool: *mut ngx_pool_t,
        key: *mut u_char,
        salt: *mut u_char,
        encrypted: *mut *mut u_char,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_dlerror() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ngx_parse_size(line: *mut ngx_str_t) -> isize;
}
extern "C" {
    pub fn ngx_parse_offset(line: *mut ngx_str_t) -> off_t;
}
extern "C" {
    pub fn ngx_parse_time(line: *mut ngx_str_t, is_sec: ngx_uint_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_parse_http_time(value: *mut u_char, len: usize) -> time_t;
}
pub type ngx_log_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(log: *mut ngx_log_t, buf: *mut u_char, len: usize) -> *mut u_char,
>;
pub type ngx_log_writer_pt = ::std::option::Option<
    unsafe extern "C" fn(log: *mut ngx_log_t, level: ngx_uint_t, buf: *mut u_char, len: usize),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_log_s {
    pub log_level: ngx_uint_t,
    pub file: *mut ngx_open_file_t,
    pub connection: ngx_atomic_uint_t,
    pub disk_full_time: time_t,
    pub handler: ngx_log_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub writer: ngx_log_writer_pt,
    pub wdata: *mut ::std::os::raw::c_void,
    pub action: *mut ::std::os::raw::c_char,
    pub next: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_log_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_log_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_log_s>(),
        80usize,
        concat!("Size of: ", stringify!(ngx_log_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_log_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_log_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(log_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connection) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(connection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disk_full_time) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(disk_full_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).writer) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wdata) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(wdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_log_s),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn ngx_log_error_core(
        level: ngx_uint_t,
        log: *mut ngx_log_t,
        err: ngx_err_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn ngx_log_init(prefix: *mut u_char, error_log: *mut u_char) -> *mut ngx_log_t;
}
extern "C" {
    pub fn ngx_log_abort(err: ngx_err_t, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn ngx_log_stderr(err: ngx_err_t, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn ngx_log_errno(buf: *mut u_char, last: *mut u_char, err: ngx_err_t) -> *mut u_char;
}
extern "C" {
    pub fn ngx_log_open_default(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_log_redirect_stderr(cycle: *mut ngx_cycle_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_log_get_file_log(head: *mut ngx_log_t) -> *mut ngx_log_t;
}
extern "C" {
    pub fn ngx_log_set_log(
        cf: *mut ngx_conf_t,
        head: *mut *mut ngx_log_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut ngx_errlog_module: ngx_module_t;
}
extern "C" {
    pub static mut ngx_use_stderr: ngx_uint_t;
}
extern "C" {
    pub fn ngx_alloc(size: usize, log: *mut ngx_log_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_calloc(size: usize, log: *mut ngx_log_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_memalign(
        alignment: usize,
        size: usize,
        log: *mut ngx_log_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub static mut ngx_pagesize: ngx_uint_t;
}
extern "C" {
    pub static mut ngx_pagesize_shift: ngx_uint_t;
}
extern "C" {
    pub static mut ngx_cacheline_size: ngx_uint_t;
}
pub type ngx_pool_cleanup_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type ngx_pool_cleanup_t = ngx_pool_cleanup_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_cleanup_s {
    pub handler: ngx_pool_cleanup_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub next: *mut ngx_pool_cleanup_t,
}
#[test]
fn bindgen_test_layout_ngx_pool_cleanup_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_pool_cleanup_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_pool_cleanup_s>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_pool_cleanup_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_pool_cleanup_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_pool_cleanup_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_s),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_s),
            "::",
            stringify!(next)
        )
    );
}
pub type ngx_pool_large_t = ngx_pool_large_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_large_s {
    pub next: *mut ngx_pool_large_t,
    pub alloc: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ngx_pool_large_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_pool_large_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_pool_large_s>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_pool_large_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_pool_large_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_pool_large_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_large_s),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_large_s),
            "::",
            stringify!(alloc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_data_t {
    pub last: *mut u_char,
    pub end: *mut u_char,
    pub next: *mut ngx_pool_t,
    pub failed: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_pool_data_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_pool_data_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_pool_data_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_pool_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_pool_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_pool_data_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_data_t),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_data_t),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_data_t),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).failed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_data_t),
            "::",
            stringify!(failed)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_s {
    pub d: ngx_pool_data_t,
    pub max: usize,
    pub current: *mut ngx_pool_t,
    pub chain: *mut ngx_chain_t,
    pub large: *mut ngx_pool_large_t,
    pub cleanup: *mut ngx_pool_cleanup_t,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_pool_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_pool_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_pool_s>(),
        80usize,
        concat!("Size of: ", stringify!(ngx_pool_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_pool_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_pool_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chain) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).large) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(large)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cleanup) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(cleanup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_s),
            "::",
            stringify!(log)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_pool_cleanup_file_t {
    pub fd: ngx_fd_t,
    pub name: *mut u_char,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_pool_cleanup_file_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_pool_cleanup_file_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_pool_cleanup_file_t>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_pool_cleanup_file_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_pool_cleanup_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_pool_cleanup_file_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_file_t),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_file_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_pool_cleanup_file_t),
            "::",
            stringify!(log)
        )
    );
}
extern "C" {
    pub fn ngx_create_pool(size: usize, log: *mut ngx_log_t) -> *mut ngx_pool_t;
}
extern "C" {
    pub fn ngx_destroy_pool(pool: *mut ngx_pool_t);
}
extern "C" {
    pub fn ngx_reset_pool(pool: *mut ngx_pool_t);
}
extern "C" {
    pub fn ngx_palloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_pnalloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_pcalloc(pool: *mut ngx_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_pmemalign(
        pool: *mut ngx_pool_t,
        size: usize,
        alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_pfree(pool: *mut ngx_pool_t, p: *mut ::std::os::raw::c_void) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_pool_cleanup_add(p: *mut ngx_pool_t, size: usize) -> *mut ngx_pool_cleanup_t;
}
extern "C" {
    pub fn ngx_pool_run_cleanup_file(p: *mut ngx_pool_t, fd: ngx_fd_t);
}
extern "C" {
    pub fn ngx_pool_cleanup_file(data: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn ngx_pool_delete_file(data: *mut ::std::os::raw::c_void);
}
pub type ngx_buf_tag_t = *mut ::std::os::raw::c_void;
pub type ngx_buf_t = ngx_buf_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_buf_s {
    pub pos: *mut u_char,
    pub last: *mut u_char,
    pub file_pos: off_t,
    pub file_last: off_t,
    pub start: *mut u_char,
    pub end: *mut u_char,
    pub tag: ngx_buf_tag_t,
    pub file: *mut ngx_file_t,
    pub shadow: *mut ngx_buf_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub num: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ngx_buf_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_buf_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_buf_s>(),
        80usize,
        concat!("Size of: ", stringify!(ngx_buf_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_buf_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_buf_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_pos) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(file_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_last) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(file_last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadow) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(shadow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_buf_s),
            "::",
            stringify!(num)
        )
    );
}
impl ngx_buf_s {
    #[inline]
    pub fn temporary(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporary(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn memory(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_memory(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mmap(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mmap(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn recycled(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_recycled(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn in_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_in_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flush(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_flush(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sync(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sync(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn last_buf(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_buf(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn last_in_chain(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_in_chain(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn last_shadow(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_last_shadow(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn temp_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temp_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        temporary: ::std::os::raw::c_uint,
        memory: ::std::os::raw::c_uint,
        mmap: ::std::os::raw::c_uint,
        recycled: ::std::os::raw::c_uint,
        in_file: ::std::os::raw::c_uint,
        flush: ::std::os::raw::c_uint,
        sync: ::std::os::raw::c_uint,
        last_buf: ::std::os::raw::c_uint,
        last_in_chain: ::std::os::raw::c_uint,
        last_shadow: ::std::os::raw::c_uint,
        temp_file: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let temporary: u32 = unsafe { ::std::mem::transmute(temporary) };
            temporary as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let memory: u32 = unsafe { ::std::mem::transmute(memory) };
            memory as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let mmap: u32 = unsafe { ::std::mem::transmute(mmap) };
            mmap as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let recycled: u32 = unsafe { ::std::mem::transmute(recycled) };
            recycled as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let in_file: u32 = unsafe { ::std::mem::transmute(in_file) };
            in_file as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let flush: u32 = unsafe { ::std::mem::transmute(flush) };
            flush as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let sync: u32 = unsafe { ::std::mem::transmute(sync) };
            sync as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let last_buf: u32 = unsafe { ::std::mem::transmute(last_buf) };
            last_buf as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let last_in_chain: u32 = unsafe { ::std::mem::transmute(last_in_chain) };
            last_in_chain as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let last_shadow: u32 = unsafe { ::std::mem::transmute(last_shadow) };
            last_shadow as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let temp_file: u32 = unsafe { ::std::mem::transmute(temp_file) };
            temp_file as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_chain_s {
    pub buf: *mut ngx_buf_t,
    pub next: *mut ngx_chain_t,
}
#[test]
fn bindgen_test_layout_ngx_chain_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_chain_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_chain_s>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_chain_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_chain_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_chain_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_s),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_s),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_bufs_t {
    pub num: ngx_int_t,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_ngx_bufs_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_bufs_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_bufs_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_bufs_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_bufs_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_bufs_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_bufs_t),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_bufs_t),
            "::",
            stringify!(size)
        )
    );
}
pub type ngx_output_chain_ctx_t = ngx_output_chain_ctx_s;
pub type ngx_output_chain_filter_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, in_: *mut ngx_chain_t) -> ngx_int_t,
>;
pub type ngx_output_chain_aio_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ngx_output_chain_ctx_t, file: *mut ngx_file_t),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_output_chain_ctx_s {
    pub buf: *mut ngx_buf_t,
    pub in_: *mut ngx_chain_t,
    pub free: *mut ngx_chain_t,
    pub busy: *mut ngx_chain_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub aio_handler: ngx_output_chain_aio_pt,
    pub thread_handler: ::std::option::Option<
        unsafe extern "C" fn(task: *mut ngx_thread_task_t, file: *mut ngx_file_t) -> ngx_int_t,
    >,
    pub thread_task: *mut ngx_thread_task_t,
    pub alignment: off_t,
    pub pool: *mut ngx_pool_t,
    pub allocated: ngx_int_t,
    pub bufs: ngx_bufs_t,
    pub tag: ngx_buf_tag_t,
    pub output_filter: ngx_output_chain_filter_pt,
    pub filter_ctx: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ngx_output_chain_ctx_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_output_chain_ctx_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_output_chain_ctx_s>(),
        128usize,
        concat!("Size of: ", stringify!(ngx_output_chain_ctx_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_output_chain_ctx_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_output_chain_ctx_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(in_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(busy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_handler) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(aio_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_handler) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(thread_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_task) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(thread_task)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alignment) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocated) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(allocated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufs) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(bufs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output_filter) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(output_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filter_ctx) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_output_chain_ctx_s),
            "::",
            stringify!(filter_ctx)
        )
    );
}
impl ngx_output_chain_ctx_s {
    #[inline]
    pub fn sendfile(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sendfile(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unaligned(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_unaligned(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn need_in_memory(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_need_in_memory(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn need_in_temp(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_need_in_temp(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn aio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_aio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sendfile: ::std::os::raw::c_uint,
        directio: ::std::os::raw::c_uint,
        unaligned: ::std::os::raw::c_uint,
        need_in_memory: ::std::os::raw::c_uint,
        need_in_temp: ::std::os::raw::c_uint,
        aio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let sendfile: u32 = unsafe { ::std::mem::transmute(sendfile) };
            sendfile as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let directio: u32 = unsafe { ::std::mem::transmute(directio) };
            directio as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let unaligned: u32 = unsafe { ::std::mem::transmute(unaligned) };
            unaligned as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let need_in_memory: u32 = unsafe { ::std::mem::transmute(need_in_memory) };
            need_in_memory as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let need_in_temp: u32 = unsafe { ::std::mem::transmute(need_in_temp) };
            need_in_temp as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let aio: u32 = unsafe { ::std::mem::transmute(aio) };
            aio as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_chain_writer_ctx_t {
    pub out: *mut ngx_chain_t,
    pub last: *mut *mut ngx_chain_t,
    pub connection: *mut ngx_connection_t,
    pub pool: *mut ngx_pool_t,
    pub limit: off_t,
}
#[test]
fn bindgen_test_layout_ngx_chain_writer_ctx_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_chain_writer_ctx_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_chain_writer_ctx_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_chain_writer_ctx_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_chain_writer_ctx_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_chain_writer_ctx_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_writer_ctx_t),
            "::",
            stringify!(out)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_writer_ctx_t),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connection) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_writer_ctx_t),
            "::",
            stringify!(connection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_writer_ctx_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_chain_writer_ctx_t),
            "::",
            stringify!(limit)
        )
    );
}
extern "C" {
    pub fn ngx_create_temp_buf(pool: *mut ngx_pool_t, size: usize) -> *mut ngx_buf_t;
}
extern "C" {
    pub fn ngx_create_chain_of_bufs(
        pool: *mut ngx_pool_t,
        bufs: *mut ngx_bufs_t,
    ) -> *mut ngx_chain_t;
}
extern "C" {
    pub fn ngx_alloc_chain_link(pool: *mut ngx_pool_t) -> *mut ngx_chain_t;
}
extern "C" {
    pub fn ngx_output_chain(ctx: *mut ngx_output_chain_ctx_t, in_: *mut ngx_chain_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_chain_writer(ctx: *mut ::std::os::raw::c_void, in_: *mut ngx_chain_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_chain_add_copy(
        pool: *mut ngx_pool_t,
        chain: *mut *mut ngx_chain_t,
        in_: *mut ngx_chain_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_chain_get_free_buf(
        p: *mut ngx_pool_t,
        free: *mut *mut ngx_chain_t,
    ) -> *mut ngx_chain_t;
}
extern "C" {
    pub fn ngx_chain_update_chains(
        p: *mut ngx_pool_t,
        free: *mut *mut ngx_chain_t,
        busy: *mut *mut ngx_chain_t,
        out: *mut *mut ngx_chain_t,
        tag: ngx_buf_tag_t,
    );
}
extern "C" {
    pub fn ngx_chain_coalesce_file(in_: *mut *mut ngx_chain_t, limit: off_t) -> off_t;
}
extern "C" {
    pub fn ngx_chain_update_sent(in_: *mut ngx_chain_t, sent: off_t) -> *mut ngx_chain_t;
}
pub type ngx_queue_t = ngx_queue_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_queue_s {
    pub prev: *mut ngx_queue_t,
    pub next: *mut ngx_queue_t,
}
#[test]
fn bindgen_test_layout_ngx_queue_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_queue_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_queue_s>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_queue_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_queue_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_queue_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_queue_s),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_queue_s),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn ngx_queue_middle(queue: *mut ngx_queue_t) -> *mut ngx_queue_t;
}
extern "C" {
    pub fn ngx_queue_sort(
        queue: *mut ngx_queue_t,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const ngx_queue_t, arg2: *const ngx_queue_t) -> ngx_int_t,
        >,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_array_t {
    pub elts: *mut ::std::os::raw::c_void,
    pub nelts: ngx_uint_t,
    pub size: usize,
    pub nalloc: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
}
#[test]
fn bindgen_test_layout_ngx_array_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_array_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_array_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_array_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elts) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_array_t),
            "::",
            stringify!(elts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nelts) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_array_t),
            "::",
            stringify!(nelts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_array_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_array_t),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_array_t),
            "::",
            stringify!(pool)
        )
    );
}
extern "C" {
    pub fn ngx_array_create(p: *mut ngx_pool_t, n: ngx_uint_t, size: usize) -> *mut ngx_array_t;
}
extern "C" {
    pub fn ngx_array_destroy(a: *mut ngx_array_t);
}
extern "C" {
    pub fn ngx_array_push(a: *mut ngx_array_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_array_push_n(a: *mut ngx_array_t, n: ngx_uint_t) -> *mut ::std::os::raw::c_void;
}
pub type ngx_list_part_t = ngx_list_part_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_list_part_s {
    pub elts: *mut ::std::os::raw::c_void,
    pub nelts: ngx_uint_t,
    pub next: *mut ngx_list_part_t,
}
#[test]
fn bindgen_test_layout_ngx_list_part_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_list_part_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_list_part_s>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_list_part_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_list_part_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_list_part_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elts) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_part_s),
            "::",
            stringify!(elts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nelts) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_part_s),
            "::",
            stringify!(nelts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_part_s),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_list_t {
    pub last: *mut ngx_list_part_t,
    pub part: ngx_list_part_t,
    pub size: usize,
    pub nalloc: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
}
#[test]
fn bindgen_test_layout_ngx_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_list_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_list_t>(),
        56usize,
        concat!("Size of: ", stringify!(ngx_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_list_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_t),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).part) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_t),
            "::",
            stringify!(part)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_t),
            "::",
            stringify!(nalloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_list_t),
            "::",
            stringify!(pool)
        )
    );
}
extern "C" {
    pub fn ngx_list_create(pool: *mut ngx_pool_t, n: ngx_uint_t, size: usize) -> *mut ngx_list_t;
}
extern "C" {
    pub fn ngx_list_push(list: *mut ngx_list_t) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_elt_t {
    pub value: *mut ::std::os::raw::c_void,
    pub len: u_short,
    pub name: [u_char; 1usize],
}
#[test]
fn bindgen_test_layout_ngx_hash_elt_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_elt_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_elt_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_hash_elt_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_elt_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_elt_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_elt_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_elt_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_elt_t),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_t {
    pub buckets: *mut *mut ngx_hash_elt_t,
    pub size: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_hash_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_hash_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buckets) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_t),
            "::",
            stringify!(buckets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_wildcard_t {
    pub hash: ngx_hash_t,
    pub value: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ngx_hash_wildcard_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_wildcard_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_wildcard_t>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_hash_wildcard_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_wildcard_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_wildcard_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_wildcard_t),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_wildcard_t),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_key_t {
    pub key: ngx_str_t,
    pub key_hash: ngx_uint_t,
    pub value: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ngx_hash_key_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_key_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_key_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_hash_key_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_key_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_key_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_key_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_hash) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_key_t),
            "::",
            stringify!(key_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_key_t),
            "::",
            stringify!(value)
        )
    );
}
pub type ngx_hash_key_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut u_char, len: usize) -> ngx_uint_t>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_combined_t {
    pub hash: ngx_hash_t,
    pub wc_head: *mut ngx_hash_wildcard_t,
    pub wc_tail: *mut ngx_hash_wildcard_t,
}
#[test]
fn bindgen_test_layout_ngx_hash_combined_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_combined_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_combined_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_hash_combined_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_combined_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_combined_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_combined_t),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wc_head) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_combined_t),
            "::",
            stringify!(wc_head)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wc_tail) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_combined_t),
            "::",
            stringify!(wc_tail)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_init_t {
    pub hash: *mut ngx_hash_t,
    pub key: ngx_hash_key_pt,
    pub max_size: ngx_uint_t,
    pub bucket_size: ngx_uint_t,
    pub name: *mut ::std::os::raw::c_char,
    pub pool: *mut ngx_pool_t,
    pub temp_pool: *mut ngx_pool_t,
}
#[test]
fn bindgen_test_layout_ngx_hash_init_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_init_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_init_t>(),
        56usize,
        concat!("Size of: ", stringify!(ngx_hash_init_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_init_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_init_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(max_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bucket_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(bucket_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temp_pool) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_init_t),
            "::",
            stringify!(temp_pool)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_hash_keys_arrays_t {
    pub hsize: ngx_uint_t,
    pub pool: *mut ngx_pool_t,
    pub temp_pool: *mut ngx_pool_t,
    pub keys: ngx_array_t,
    pub keys_hash: *mut ngx_array_t,
    pub dns_wc_head: ngx_array_t,
    pub dns_wc_head_hash: *mut ngx_array_t,
    pub dns_wc_tail: ngx_array_t,
    pub dns_wc_tail_hash: *mut ngx_array_t,
}
#[test]
fn bindgen_test_layout_ngx_hash_keys_arrays_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_hash_keys_arrays_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_hash_keys_arrays_t>(),
        168usize,
        concat!("Size of: ", stringify!(ngx_hash_keys_arrays_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_hash_keys_arrays_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_hash_keys_arrays_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hsize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(hsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temp_pool) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(temp_pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keys) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keys_hash) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(keys_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dns_wc_head) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(dns_wc_head)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dns_wc_head_hash) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(dns_wc_head_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dns_wc_tail) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(dns_wc_tail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dns_wc_tail_hash) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_hash_keys_arrays_t),
            "::",
            stringify!(dns_wc_tail_hash)
        )
    );
}
pub type ngx_table_elt_t = ngx_table_elt_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_table_elt_s {
    pub hash: ngx_uint_t,
    pub key: ngx_str_t,
    pub value: ngx_str_t,
    pub lowcase_key: *mut u_char,
    pub next: *mut ngx_table_elt_t,
}
#[test]
fn bindgen_test_layout_ngx_table_elt_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_table_elt_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_table_elt_s>(),
        56usize,
        concat!("Size of: ", stringify!(ngx_table_elt_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_table_elt_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_table_elt_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_table_elt_s),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_table_elt_s),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_table_elt_s),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lowcase_key) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_table_elt_s),
            "::",
            stringify!(lowcase_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_table_elt_s),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn ngx_hash_find(
        hash: *mut ngx_hash_t,
        key: ngx_uint_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_hash_find_wc_head(
        hwc: *mut ngx_hash_wildcard_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_hash_find_wc_tail(
        hwc: *mut ngx_hash_wildcard_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_hash_find_combined(
        hash: *mut ngx_hash_combined_t,
        key: ngx_uint_t,
        name: *mut u_char,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_hash_init(
        hinit: *mut ngx_hash_init_t,
        names: *mut ngx_hash_key_t,
        nelts: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_hash_wildcard_init(
        hinit: *mut ngx_hash_init_t,
        names: *mut ngx_hash_key_t,
        nelts: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_hash_key(data: *mut u_char, len: usize) -> ngx_uint_t;
}
extern "C" {
    pub fn ngx_hash_key_lc(data: *mut u_char, len: usize) -> ngx_uint_t;
}
extern "C" {
    pub fn ngx_hash_strlow(dst: *mut u_char, src: *mut u_char, n: usize) -> ngx_uint_t;
}
extern "C" {
    pub fn ngx_hash_keys_array_init(
        ha: *mut ngx_hash_keys_arrays_t,
        type_: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_hash_add_key(
        ha: *mut ngx_hash_keys_arrays_t,
        key: *mut ngx_str_t,
        value: *mut ::std::os::raw::c_void,
        flags: ngx_uint_t,
    ) -> ngx_int_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_file_s {
    pub fd: ngx_fd_t,
    pub name: ngx_str_t,
    pub info: ngx_file_info_t,
    pub offset: off_t,
    pub sys_offset: off_t,
    pub log: *mut ngx_log_t,
    pub thread_handler: ::std::option::Option<
        unsafe extern "C" fn(task: *mut ngx_thread_task_t, file: *mut ngx_file_t) -> ngx_int_t,
    >,
    pub thread_ctx: *mut ::std::os::raw::c_void,
    pub thread_task: *mut ngx_thread_task_t,
    pub aio: *mut ngx_event_aio_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_ngx_file_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_file_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_file_s>(),
        232usize,
        concat!("Size of: ", stringify!(ngx_file_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_file_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_file_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sys_offset) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(sys_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_handler) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(thread_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_ctx) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(thread_ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_task) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(thread_task)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_file_s),
            "::",
            stringify!(aio)
        )
    );
}
impl ngx_file_s {
    #[inline]
    pub fn valid_info(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_valid_info(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directio(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directio(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        valid_info: ::std::os::raw::c_uint,
        directio: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let valid_info: u32 = unsafe { ::std::mem::transmute(valid_info) };
            valid_info as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let directio: u32 = unsafe { ::std::mem::transmute(directio) };
            directio as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ngx_path_manager_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ngx_msec_t>;
pub type ngx_path_purger_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ngx_msec_t>;
pub type ngx_path_loader_pt =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_path_t {
    pub name: ngx_str_t,
    pub len: usize,
    pub level: [usize; 3usize],
    pub manager: ngx_path_manager_pt,
    pub purger: ngx_path_purger_pt,
    pub loader: ngx_path_loader_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub conf_file: *mut u_char,
    pub line: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_path_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_path_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_path_t>(),
        96usize,
        concat!("Size of: ", stringify!(ngx_path_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_path_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_path_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).manager) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(manager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).purger) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(purger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loader) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(loader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conf_file) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(conf_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_t),
            "::",
            stringify!(line)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_path_init_t {
    pub name: ngx_str_t,
    pub level: [usize; 3usize],
}
#[test]
fn bindgen_test_layout_ngx_path_init_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_path_init_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_path_init_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_path_init_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_path_init_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_path_init_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_init_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_path_init_t),
            "::",
            stringify!(level)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_temp_file_t {
    pub file: ngx_file_t,
    pub offset: off_t,
    pub path: *mut ngx_path_t,
    pub pool: *mut ngx_pool_t,
    pub warn: *mut ::std::os::raw::c_char,
    pub access: ngx_uint_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[test]
fn bindgen_test_layout_ngx_temp_file_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_temp_file_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_temp_file_t>(),
        280usize,
        concat!("Size of: ", stringify!(ngx_temp_file_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_temp_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_temp_file_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warn) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(warn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_temp_file_t),
            "::",
            stringify!(access)
        )
    );
}
impl ngx_temp_file_t {
    #[inline]
    pub fn log_level(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_log_level(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn persistent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_persistent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn clean(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_clean(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn thread_write(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_thread_write(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        log_level: ::std::os::raw::c_uint,
        persistent: ::std::os::raw::c_uint,
        clean: ::std::os::raw::c_uint,
        thread_write: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let log_level: u32 = unsafe { ::std::mem::transmute(log_level) };
            log_level as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let persistent: u32 = unsafe { ::std::mem::transmute(persistent) };
            persistent as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let clean: u32 = unsafe { ::std::mem::transmute(clean) };
            clean as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let thread_write: u32 = unsafe { ::std::mem::transmute(thread_write) };
            thread_write as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ext_rename_file_t {
    pub access: ngx_uint_t,
    pub path_access: ngx_uint_t,
    pub time: time_t,
    pub fd: ngx_fd_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_ext_rename_file_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_ext_rename_file_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_ext_rename_file_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_ext_rename_file_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_ext_rename_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_ext_rename_file_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ext_rename_file_t),
            "::",
            stringify!(access)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_access) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ext_rename_file_t),
            "::",
            stringify!(path_access)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ext_rename_file_t),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ext_rename_file_t),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ext_rename_file_t),
            "::",
            stringify!(log)
        )
    );
}
impl ngx_ext_rename_file_t {
    #[inline]
    pub fn create_path(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_create_path(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn delete_file(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_delete_file(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        create_path: ::std::os::raw::c_uint,
        delete_file: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let create_path: u32 = unsafe { ::std::mem::transmute(create_path) };
            create_path as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let delete_file: u32 = unsafe { ::std::mem::transmute(delete_file) };
            delete_file as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_copy_file_t {
    pub size: off_t,
    pub buf_size: usize,
    pub access: ngx_uint_t,
    pub time: time_t,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_copy_file_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_copy_file_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_copy_file_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_copy_file_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_copy_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_copy_file_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_copy_file_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_copy_file_t),
            "::",
            stringify!(buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_copy_file_t),
            "::",
            stringify!(access)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_copy_file_t),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_copy_file_t),
            "::",
            stringify!(log)
        )
    );
}
pub type ngx_tree_ctx_t = ngx_tree_ctx_s;
pub type ngx_tree_init_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        prev: *mut ::std::os::raw::c_void,
    ) -> ngx_int_t,
>;
pub type ngx_tree_handler_pt = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ngx_tree_ctx_t, name: *mut ngx_str_t) -> ngx_int_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_tree_ctx_s {
    pub size: off_t,
    pub fs_size: off_t,
    pub access: ngx_uint_t,
    pub mtime: time_t,
    pub init_handler: ngx_tree_init_handler_pt,
    pub file_handler: ngx_tree_handler_pt,
    pub pre_tree_handler: ngx_tree_handler_pt,
    pub post_tree_handler: ngx_tree_handler_pt,
    pub spec_handler: ngx_tree_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub alloc: usize,
    pub log: *mut ngx_log_t,
}
#[test]
fn bindgen_test_layout_ngx_tree_ctx_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_tree_ctx_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_tree_ctx_s>(),
        96usize,
        concat!("Size of: ", stringify!(ngx_tree_ctx_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_tree_ctx_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_tree_ctx_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(fs_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(access)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(mtime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_handler) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(init_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_handler) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(file_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_tree_handler) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(pre_tree_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).post_tree_handler) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(post_tree_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spec_handler) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(spec_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_tree_ctx_s),
            "::",
            stringify!(log)
        )
    );
}
extern "C" {
    pub fn ngx_get_full_name(
        pool: *mut ngx_pool_t,
        prefix: *mut ngx_str_t,
        name: *mut ngx_str_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_write_chain_to_temp_file(tf: *mut ngx_temp_file_t, chain: *mut ngx_chain_t)
        -> isize;
}
extern "C" {
    pub fn ngx_create_temp_file(
        file: *mut ngx_file_t,
        path: *mut ngx_path_t,
        pool: *mut ngx_pool_t,
        persistent: ngx_uint_t,
        clean: ngx_uint_t,
        access: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_create_hashed_filename(path: *mut ngx_path_t, file: *mut u_char, len: usize);
}
extern "C" {
    pub fn ngx_create_path(file: *mut ngx_file_t, path: *mut ngx_path_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_create_full_path(dir: *mut u_char, access: ngx_uint_t) -> ngx_err_t;
}
extern "C" {
    pub fn ngx_add_path(cf: *mut ngx_conf_t, slot: *mut *mut ngx_path_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_create_paths(cycle: *mut ngx_cycle_t, user: ngx_uid_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_ext_rename_file(
        src: *mut ngx_str_t,
        to: *mut ngx_str_t,
        ext: *mut ngx_ext_rename_file_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_copy_file(from: *mut u_char, to: *mut u_char, cf: *mut ngx_copy_file_t)
        -> ngx_int_t;
}
extern "C" {
    pub fn ngx_walk_tree(ctx: *mut ngx_tree_ctx_t, tree: *mut ngx_str_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_next_temp_number(collision: ngx_uint_t) -> ngx_atomic_uint_t;
}
extern "C" {
    pub fn ngx_conf_set_path_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ngx_conf_merge_path_value(
        cf: *mut ngx_conf_t,
        path: *mut *mut ngx_path_t,
        prev: *mut ngx_path_t,
        init: *mut ngx_path_init_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ngx_conf_set_access_slot(
        cf: *mut ngx_conf_t,
        cmd: *mut ngx_command_t,
        conf: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut ngx_temp_number: *mut ngx_atomic_t;
}
extern "C" {
    pub static mut ngx_random_number: ngx_atomic_int_t;
}
extern "C" {
    pub static mut ngx_crc32_table_short: *mut u32;
}
extern "C" {
    pub static mut ngx_crc32_table256: [u32; 0usize];
}
extern "C" {
    pub fn ngx_crc32_table_init() -> ngx_int_t;
}
extern "C" {
    pub fn ngx_murmur_hash2(data: *mut u_char, len: usize) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_code_8 {
    _unused: [u8; 0],
}
pub type pcre2_code_8 = pcre2_real_code_8;
pub type ngx_regex_t = pcre2_code_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_regex_compile_t {
    pub pattern: ngx_str_t,
    pub pool: *mut ngx_pool_t,
    pub options: ngx_uint_t,
    pub regex: *mut ngx_regex_t,
    pub captures: ::std::os::raw::c_int,
    pub named_captures: ::std::os::raw::c_int,
    pub name_size: ::std::os::raw::c_int,
    pub names: *mut u_char,
    pub err: ngx_str_t,
}
#[test]
fn bindgen_test_layout_ngx_regex_compile_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_regex_compile_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_regex_compile_t>(),
        80usize,
        concat!("Size of: ", stringify!(ngx_regex_compile_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_regex_compile_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_regex_compile_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pattern) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(regex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).captures) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(captures)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).named_captures) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(named_captures)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(name_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).names) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(names)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_compile_t),
            "::",
            stringify!(err)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_regex_elt_t {
    pub regex: *mut ngx_regex_t,
    pub name: *mut u_char,
}
#[test]
fn bindgen_test_layout_ngx_regex_elt_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_regex_elt_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_regex_elt_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_regex_elt_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_regex_elt_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_regex_elt_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_elt_t),
            "::",
            stringify!(regex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_regex_elt_t),
            "::",
            stringify!(name)
        )
    );
}
extern "C" {
    pub fn ngx_regex_init();
}
extern "C" {
    pub fn ngx_regex_compile(rc: *mut ngx_regex_compile_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_regex_exec(
        re: *mut ngx_regex_t,
        s: *mut ngx_str_t,
        captures: *mut ::std::os::raw::c_int,
        size: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_regex_exec_array(
        a: *mut ngx_array_t,
        s: *mut ngx_str_t,
        log: *mut ngx_log_t,
    ) -> ngx_int_t;
}
pub type ngx_radix_node_t = ngx_radix_node_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_radix_node_s {
    pub right: *mut ngx_radix_node_t,
    pub left: *mut ngx_radix_node_t,
    pub parent: *mut ngx_radix_node_t,
    pub value: usize,
}
#[test]
fn bindgen_test_layout_ngx_radix_node_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_radix_node_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_radix_node_s>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_radix_node_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_radix_node_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_radix_node_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_node_s),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_node_s),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_node_s),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_node_s),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_radix_tree_t {
    pub root: *mut ngx_radix_node_t,
    pub pool: *mut ngx_pool_t,
    pub free: *mut ngx_radix_node_t,
    pub start: *mut ::std::os::raw::c_char,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_ngx_radix_tree_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_radix_tree_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_radix_tree_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_radix_tree_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_radix_tree_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_radix_tree_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_tree_t),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_tree_t),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_tree_t),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_tree_t),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_radix_tree_t),
            "::",
            stringify!(size)
        )
    );
}
extern "C" {
    pub fn ngx_radix_tree_create(
        pool: *mut ngx_pool_t,
        preallocate: ngx_int_t,
    ) -> *mut ngx_radix_tree_t;
}
extern "C" {
    pub fn ngx_radix32tree_insert(
        tree: *mut ngx_radix_tree_t,
        key: u32,
        mask: u32,
        value: usize,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_radix32tree_delete(tree: *mut ngx_radix_tree_t, key: u32, mask: u32) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_radix32tree_find(tree: *mut ngx_radix_tree_t, key: u32) -> usize;
}
extern "C" {
    pub fn ngx_radix128tree_insert(
        tree: *mut ngx_radix_tree_t,
        key: *mut u_char,
        mask: *mut u_char,
        value: usize,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_radix128tree_delete(
        tree: *mut ngx_radix_tree_t,
        key: *mut u_char,
        mask: *mut u_char,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_radix128tree_find(tree: *mut ngx_radix_tree_t, key: *mut u_char) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_time_t {
    pub sec: time_t,
    pub msec: ngx_uint_t,
    pub gmtoff: ngx_int_t,
}
#[test]
fn bindgen_test_layout_ngx_time_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_time_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_time_t>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_time_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_time_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_time_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_time_t),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_time_t),
            "::",
            stringify!(msec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gmtoff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_time_t),
            "::",
            stringify!(gmtoff)
        )
    );
}
extern "C" {
    pub fn ngx_time_init();
}
extern "C" {
    pub fn ngx_time_update();
}
extern "C" {
    pub fn ngx_time_sigsafe_update();
}
extern "C" {
    pub fn ngx_http_time(buf: *mut u_char, t: time_t) -> *mut u_char;
}
extern "C" {
    pub fn ngx_http_cookie_time(buf: *mut u_char, t: time_t) -> *mut u_char;
}
extern "C" {
    pub fn ngx_gmtime(t: time_t, tp: *mut ngx_tm_t);
}
extern "C" {
    pub fn ngx_next_time(when: time_t) -> time_t;
}
extern "C" {
    pub static mut ngx_cached_time: *mut ngx_time_t;
}
extern "C" {
    pub static mut ngx_cached_err_log_time: ngx_str_t;
}
extern "C" {
    pub static mut ngx_cached_http_time: ngx_str_t;
}
extern "C" {
    pub static mut ngx_cached_http_log_time: ngx_str_t;
}
extern "C" {
    pub static mut ngx_cached_http_log_iso8601: ngx_str_t;
}
extern "C" {
    pub static mut ngx_cached_syslog_time: ngx_str_t;
}
extern "C" {
    pub static mut ngx_current_msec: ngx_msec_t;
}
extern "C" {
    pub fn ngx_rwlock_wlock(lock: *mut ngx_atomic_t);
}
extern "C" {
    pub fn ngx_rwlock_rlock(lock: *mut ngx_atomic_t);
}
extern "C" {
    pub fn ngx_rwlock_unlock(lock: *mut ngx_atomic_t);
}
extern "C" {
    pub fn ngx_rwlock_downgrade(lock: *mut ngx_atomic_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shmtx_sh_t {
    pub lock: ngx_atomic_t,
    pub wait: ngx_atomic_t,
}
#[test]
fn bindgen_test_layout_ngx_shmtx_sh_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_shmtx_sh_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_shmtx_sh_t>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_shmtx_sh_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_shmtx_sh_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_shmtx_sh_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_sh_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wait) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_sh_t),
            "::",
            stringify!(wait)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_shmtx_t {
    pub lock: *mut ngx_atomic_t,
    pub wait: *mut ngx_atomic_t,
    pub semaphore: ngx_uint_t,
    pub sem: sem_t,
    pub spin: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_shmtx_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_shmtx_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_shmtx_t>(),
        64usize,
        concat!("Size of: ", stringify!(ngx_shmtx_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_shmtx_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_shmtx_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wait) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_t),
            "::",
            stringify!(wait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).semaphore) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_t),
            "::",
            stringify!(semaphore)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sem) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_t),
            "::",
            stringify!(sem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spin) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shmtx_t),
            "::",
            stringify!(spin)
        )
    );
}
extern "C" {
    pub fn ngx_shmtx_create(
        mtx: *mut ngx_shmtx_t,
        addr: *mut ngx_shmtx_sh_t,
        name: *mut u_char,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_shmtx_destroy(mtx: *mut ngx_shmtx_t);
}
extern "C" {
    pub fn ngx_shmtx_trylock(mtx: *mut ngx_shmtx_t) -> ngx_uint_t;
}
extern "C" {
    pub fn ngx_shmtx_lock(mtx: *mut ngx_shmtx_t);
}
extern "C" {
    pub fn ngx_shmtx_unlock(mtx: *mut ngx_shmtx_t);
}
extern "C" {
    pub fn ngx_shmtx_force_unlock(mtx: *mut ngx_shmtx_t, pid: ngx_pid_t) -> ngx_uint_t;
}
pub type ngx_slab_page_t = ngx_slab_page_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_slab_page_s {
    pub slab: usize,
    pub next: *mut ngx_slab_page_t,
    pub prev: usize,
}
#[test]
fn bindgen_test_layout_ngx_slab_page_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_slab_page_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_slab_page_s>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_slab_page_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_slab_page_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_slab_page_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slab) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_page_s),
            "::",
            stringify!(slab)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_page_s),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_page_s),
            "::",
            stringify!(prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_slab_stat_t {
    pub total: ngx_uint_t,
    pub used: ngx_uint_t,
    pub reqs: ngx_uint_t,
    pub fails: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_slab_stat_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_slab_stat_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_slab_stat_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_slab_stat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_slab_stat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_slab_stat_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_stat_t),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).used) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_stat_t),
            "::",
            stringify!(used)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reqs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_stat_t),
            "::",
            stringify!(reqs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fails) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_stat_t),
            "::",
            stringify!(fails)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_slab_pool_t {
    pub lock: ngx_shmtx_sh_t,
    pub min_size: usize,
    pub min_shift: usize,
    pub pages: *mut ngx_slab_page_t,
    pub last: *mut ngx_slab_page_t,
    pub free: ngx_slab_page_t,
    pub stats: *mut ngx_slab_stat_t,
    pub pfree: ngx_uint_t,
    pub start: *mut u_char,
    pub end: *mut u_char,
    pub mutex: ngx_shmtx_t,
    pub log_ctx: *mut u_char,
    pub zero: u_char,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub data: *mut ::std::os::raw::c_void,
    pub addr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ngx_slab_pool_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_slab_pool_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_slab_pool_t>(),
        200usize,
        concat!("Size of: ", stringify!(ngx_slab_pool_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_slab_pool_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_slab_pool_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(min_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_shift) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(min_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pages) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(pages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stats) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfree) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(pfree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mutex) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_ctx) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(log_ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zero) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_slab_pool_t),
            "::",
            stringify!(addr)
        )
    );
}
impl ngx_slab_pool_t {
    #[inline]
    pub fn log_nomem(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_log_nomem(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        log_nomem: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let log_nomem: u32 = unsafe { ::std::mem::transmute(log_nomem) };
            log_nomem as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ngx_slab_sizes_init();
}
extern "C" {
    pub fn ngx_slab_init(pool: *mut ngx_slab_pool_t);
}
extern "C" {
    pub fn ngx_slab_alloc(pool: *mut ngx_slab_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_slab_alloc_locked(
        pool: *mut ngx_slab_pool_t,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_slab_calloc(pool: *mut ngx_slab_pool_t, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_slab_calloc_locked(
        pool: *mut ngx_slab_pool_t,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ngx_slab_free(pool: *mut ngx_slab_pool_t, p: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn ngx_slab_free_locked(pool: *mut ngx_slab_pool_t, p: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_sockaddr_t {
    pub sockaddr: sockaddr,
    pub sockaddr_in: sockaddr_in,
    pub sockaddr_in6: sockaddr_in6,
    pub sockaddr_un: sockaddr_un,
}
#[test]
fn bindgen_test_layout_ngx_sockaddr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_sockaddr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_sockaddr_t>(),
        112usize,
        concat!("Size of: ", stringify!(ngx_sockaddr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_sockaddr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ngx_sockaddr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_sockaddr_t),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_in) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_sockaddr_t),
            "::",
            stringify!(sockaddr_in)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_in6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_sockaddr_t),
            "::",
            stringify!(sockaddr_in6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_un) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_sockaddr_t),
            "::",
            stringify!(sockaddr_un)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_in_cidr_t {
    pub addr: in_addr_t,
    pub mask: in_addr_t,
}
#[test]
fn bindgen_test_layout_ngx_in_cidr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_in_cidr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_in_cidr_t>(),
        8usize,
        concat!("Size of: ", stringify!(ngx_in_cidr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_in_cidr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ngx_in_cidr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_in_cidr_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_in_cidr_t),
            "::",
            stringify!(mask)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_in6_cidr_t {
    pub addr: in6_addr,
    pub mask: in6_addr,
}
#[test]
fn bindgen_test_layout_ngx_in6_cidr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_in6_cidr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_in6_cidr_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_in6_cidr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_in6_cidr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ngx_in6_cidr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_in6_cidr_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_in6_cidr_t),
            "::",
            stringify!(mask)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_cidr_t {
    pub family: ngx_uint_t,
    pub u: ngx_cidr_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_cidr_t__bindgen_ty_1 {
    pub in_: ngx_in_cidr_t,
    pub in6: ngx_in6_cidr_t,
}
#[test]
fn bindgen_test_layout_ngx_cidr_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_cidr_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_cidr_t__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_cidr_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_cidr_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ngx_cidr_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cidr_t__bindgen_ty_1),
            "::",
            stringify!(in_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cidr_t__bindgen_ty_1),
            "::",
            stringify!(in6)
        )
    );
}
#[test]
fn bindgen_test_layout_ngx_cidr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_cidr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_cidr_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_cidr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_cidr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_cidr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cidr_t),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cidr_t),
            "::",
            stringify!(u)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_addr_t {
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub name: ngx_str_t,
}
#[test]
fn bindgen_test_layout_ngx_addr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_addr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_addr_t>(),
        32usize,
        concat!("Size of: ", stringify!(ngx_addr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_addr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_addr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_addr_t),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).socklen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_addr_t),
            "::",
            stringify!(socklen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_addr_t),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_url_t {
    pub url: ngx_str_t,
    pub host: ngx_str_t,
    pub port_text: ngx_str_t,
    pub uri: ngx_str_t,
    pub port: in_port_t,
    pub default_port: in_port_t,
    pub last_port: in_port_t,
    pub family: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub socklen: socklen_t,
    pub sockaddr: ngx_sockaddr_t,
    pub addrs: *mut ngx_addr_t,
    pub naddrs: ngx_uint_t,
    pub err: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ngx_url_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_url_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_url_t>(),
        224usize,
        concat!("Size of: ", stringify!(ngx_url_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_url_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_url_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).url) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(url)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port_text) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(port_text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uri) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(uri)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_port) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(default_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_port) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(last_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).family) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).socklen) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(socklen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrs) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naddrs) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(naddrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_url_t),
            "::",
            stringify!(err)
        )
    );
}
impl ngx_url_t {
    #[inline]
    pub fn listen(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_listen(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn uri_part(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_uri_part(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn no_resolve(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_resolve(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn no_port(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_no_port(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wildcard(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wildcard(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        listen: ::std::os::raw::c_uint,
        uri_part: ::std::os::raw::c_uint,
        no_resolve: ::std::os::raw::c_uint,
        no_port: ::std::os::raw::c_uint,
        wildcard: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let listen: u32 = unsafe { ::std::mem::transmute(listen) };
            listen as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let uri_part: u32 = unsafe { ::std::mem::transmute(uri_part) };
            uri_part as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let no_resolve: u32 = unsafe { ::std::mem::transmute(no_resolve) };
            no_resolve as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let no_port: u32 = unsafe { ::std::mem::transmute(no_port) };
            no_port as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let wildcard: u32 = unsafe { ::std::mem::transmute(wildcard) };
            wildcard as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ngx_inet_addr(text: *mut u_char, len: usize) -> in_addr_t;
}
extern "C" {
    pub fn ngx_inet6_addr(p: *mut u_char, len: usize, addr: *mut u_char) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_inet6_ntop(p: *mut u_char, text: *mut u_char, len: usize) -> usize;
}
extern "C" {
    pub fn ngx_sock_ntop(
        sa: *mut sockaddr,
        socklen: socklen_t,
        text: *mut u_char,
        len: usize,
        port: ngx_uint_t,
    ) -> usize;
}
extern "C" {
    pub fn ngx_inet_ntop(
        family: ::std::os::raw::c_int,
        addr: *mut ::std::os::raw::c_void,
        text: *mut u_char,
        len: usize,
    ) -> usize;
}
extern "C" {
    pub fn ngx_ptocidr(text: *mut ngx_str_t, cidr: *mut ngx_cidr_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_cidr_match(sa: *mut sockaddr, cidrs: *mut ngx_array_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_parse_addr(
        pool: *mut ngx_pool_t,
        addr: *mut ngx_addr_t,
        text: *mut u_char,
        len: usize,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_parse_addr_port(
        pool: *mut ngx_pool_t,
        addr: *mut ngx_addr_t,
        text: *mut u_char,
        len: usize,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_parse_url(pool: *mut ngx_pool_t, u: *mut ngx_url_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_inet_resolve_host(pool: *mut ngx_pool_t, u: *mut ngx_url_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_cmp_sockaddr(
        sa1: *mut sockaddr,
        slen1: socklen_t,
        sa2: *mut sockaddr,
        slen2: socklen_t,
        cmp_port: ngx_uint_t,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_inet_get_port(sa: *mut sockaddr) -> in_port_t;
}
extern "C" {
    pub fn ngx_inet_set_port(sa: *mut sockaddr, port: in_port_t);
}
extern "C" {
    pub fn ngx_inet_wildcard(sa: *mut sockaddr) -> ngx_uint_t;
}
pub type ngx_shm_zone_t = ngx_shm_zone_s;
pub type ngx_shm_zone_init_pt = ::std::option::Option<
    unsafe extern "C" fn(zone: *mut ngx_shm_zone_t, data: *mut ::std::os::raw::c_void) -> ngx_int_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_shm_zone_s {
    pub data: *mut ::std::os::raw::c_void,
    pub shm: ngx_shm_t,
    pub init: ngx_shm_zone_init_pt,
    pub tag: *mut ::std::os::raw::c_void,
    pub sync: *mut ::std::os::raw::c_void,
    pub noreuse: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_shm_zone_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_shm_zone_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_shm_zone_s>(),
        88usize,
        concat!("Size of: ", stringify!(ngx_shm_zone_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_shm_zone_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_shm_zone_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(shm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(sync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noreuse) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_shm_zone_s),
            "::",
            stringify!(noreuse)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_cycle_s {
    pub conf_ctx: *mut *mut *mut *mut ::std::os::raw::c_void,
    pub pool: *mut ngx_pool_t,
    pub log: *mut ngx_log_t,
    pub new_log: ngx_log_t,
    pub log_use_stderr: ngx_uint_t,
    pub files: *mut *mut ngx_connection_t,
    pub free_connections: *mut ngx_connection_t,
    pub free_connection_n: ngx_uint_t,
    pub modules: *mut *mut ngx_module_t,
    pub modules_n: ngx_uint_t,
    pub modules_used: ngx_uint_t,
    pub reusable_connections_queue: ngx_queue_t,
    pub reusable_connections_n: ngx_uint_t,
    pub connections_reuse_time: time_t,
    pub listening: ngx_array_t,
    pub paths: ngx_array_t,
    pub config_dump: ngx_array_t,
    pub config_dump_rbtree: ngx_rbtree_t,
    pub config_dump_sentinel: ngx_rbtree_node_t,
    pub open_files: ngx_list_t,
    pub shared_memory: ngx_list_t,
    pub connection_n: ngx_uint_t,
    pub files_n: ngx_uint_t,
    pub connections: *mut ngx_connection_t,
    pub read_events: *mut ngx_event_t,
    pub write_events: *mut ngx_event_t,
    pub old_cycle: *mut ngx_cycle_t,
    pub conf_file: ngx_str_t,
    pub conf_param: ngx_str_t,
    pub conf_prefix: ngx_str_t,
    pub prefix: ngx_str_t,
    pub error_log: ngx_str_t,
    pub lock_file: ngx_str_t,
    pub hostname: ngx_str_t,
}
#[test]
fn bindgen_test_layout_ngx_cycle_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_cycle_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_cycle_s>(),
        648usize,
        concat!("Size of: ", stringify!(ngx_cycle_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_cycle_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_cycle_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conf_ctx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(conf_ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).new_log) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(new_log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_use_stderr) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(log_use_stderr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).files) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(files)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_connections) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(free_connections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_connection_n) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(free_connection_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modules) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(modules)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modules_n) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(modules_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modules_used) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(modules_used)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reusable_connections_queue) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(reusable_connections_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reusable_connections_n) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(reusable_connections_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connections_reuse_time) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(connections_reuse_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listening) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(listening)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paths) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(paths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config_dump) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(config_dump)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config_dump_rbtree) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(config_dump_rbtree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config_dump_sentinel) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(config_dump_sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open_files) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(open_files)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared_memory) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(shared_memory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connection_n) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(connection_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).files_n) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(files_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connections) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(connections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_events) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(read_events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_events) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(write_events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).old_cycle) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(old_cycle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conf_file) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(conf_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conf_param) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(conf_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conf_prefix) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(conf_prefix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prefix) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_log) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(error_log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_file) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(lock_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hostname) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_cycle_s),
            "::",
            stringify!(hostname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_core_conf_t {
    pub daemon: ngx_flag_t,
    pub master: ngx_flag_t,
    pub timer_resolution: ngx_msec_t,
    pub shutdown_timeout: ngx_msec_t,
    pub worker_processes: ngx_int_t,
    pub debug_points: ngx_int_t,
    pub rlimit_nofile: ngx_int_t,
    pub rlimit_core: off_t,
    pub priority: ::std::os::raw::c_int,
    pub cpu_affinity_auto: ngx_uint_t,
    pub cpu_affinity_n: ngx_uint_t,
    pub cpu_affinity: *mut ngx_cpuset_t,
    pub username: *mut ::std::os::raw::c_char,
    pub user: ngx_uid_t,
    pub group: ngx_gid_t,
    pub working_directory: ngx_str_t,
    pub lock_file: ngx_str_t,
    pub pid: ngx_str_t,
    pub oldpid: ngx_str_t,
    pub env: ngx_array_t,
    pub environment: *mut *mut ::std::os::raw::c_char,
    pub transparent: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_core_conf_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_core_conf_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_core_conf_t>(),
        232usize,
        concat!("Size of: ", stringify!(ngx_core_conf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_core_conf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_core_conf_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).daemon) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(daemon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timer_resolution) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(timer_resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shutdown_timeout) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(shutdown_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).worker_processes) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(worker_processes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug_points) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(debug_points)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rlimit_nofile) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(rlimit_nofile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rlimit_core) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(rlimit_core)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_affinity_auto) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(cpu_affinity_auto)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_affinity_n) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(cpu_affinity_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_affinity) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(cpu_affinity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).username) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(username)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).working_directory) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(working_directory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_file) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(lock_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oldpid) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(oldpid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).env) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(env)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).environment) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(environment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transparent) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_core_conf_t),
            "::",
            stringify!(transparent)
        )
    );
}
extern "C" {
    pub fn ngx_init_cycle(old_cycle: *mut ngx_cycle_t) -> *mut ngx_cycle_t;
}
extern "C" {
    pub fn ngx_create_pidfile(name: *mut ngx_str_t, log: *mut ngx_log_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_delete_pidfile(cycle: *mut ngx_cycle_t);
}
extern "C" {
    pub fn ngx_signal_process(
        cycle: *mut ngx_cycle_t,
        sig: *mut ::std::os::raw::c_char,
    ) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_reopen_files(cycle: *mut ngx_cycle_t, user: ngx_uid_t);
}
extern "C" {
    pub fn ngx_set_environment(
        cycle: *mut ngx_cycle_t,
        last: *mut ngx_uint_t,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ngx_exec_new_binary(
        cycle: *mut ngx_cycle_t,
        argv: *const *mut ::std::os::raw::c_char,
    ) -> ngx_pid_t;
}
extern "C" {
    pub fn ngx_get_cpu_affinity(n: ngx_uint_t) -> *mut ngx_cpuset_t;
}
extern "C" {
    pub fn ngx_shared_memory_add(
        cf: *mut ngx_conf_t,
        name: *mut ngx_str_t,
        size: usize,
        tag: *mut ::std::os::raw::c_void,
    ) -> *mut ngx_shm_zone_t;
}
extern "C" {
    pub fn ngx_set_shutdown_timer(cycle: *mut ngx_cycle_t);
}
extern "C" {
    pub static mut ngx_cycle: *mut ngx_cycle_t;
}
extern "C" {
    pub static mut ngx_old_cycles: ngx_array_t;
}
extern "C" {
    pub static mut ngx_core_module: ngx_module_t;
}
extern "C" {
    pub static mut ngx_test_config: ngx_uint_t;
}
extern "C" {
    pub static mut ngx_dump_config: ngx_uint_t;
}
extern "C" {
    pub static mut ngx_quiet_mode: ngx_uint_t;
}
pub type ngx_resolver_t = ngx_resolver_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_connection_t {
    pub udp: *mut ngx_connection_t,
    pub tcp: *mut ngx_connection_t,
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub server: ngx_str_t,
    pub log: ngx_log_t,
    pub read_buf: *mut ngx_buf_t,
    pub write_buf: *mut ngx_buf_t,
    pub resolver: *mut ngx_resolver_t,
}
#[test]
fn bindgen_test_layout_ngx_resolver_connection_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_connection_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_connection_t>(),
        152usize,
        concat!("Size of: ", stringify!(ngx_resolver_connection_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_connection_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_connection_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).udp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(udp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tcp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(tcp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).socklen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(socklen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).server) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(server)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_buf) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(read_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_buf) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(write_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolver) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_connection_t),
            "::",
            stringify!(resolver)
        )
    );
}
pub type ngx_resolver_ctx_t = ngx_resolver_ctx_s;
pub type ngx_resolver_handler_pt =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ngx_resolver_ctx_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_addr_t {
    pub sockaddr: *mut sockaddr,
    pub socklen: socklen_t,
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
}
#[test]
fn bindgen_test_layout_ngx_resolver_addr_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_addr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_addr_t>(),
        40usize,
        concat!("Size of: ", stringify!(ngx_resolver_addr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_addr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_addr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_addr_t),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).socklen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_addr_t),
            "::",
            stringify!(socklen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_addr_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_addr_t),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_addr_t),
            "::",
            stringify!(weight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_srv_t {
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
    pub port: u_short,
}
#[test]
fn bindgen_test_layout_ngx_resolver_srv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_srv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_srv_t>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_resolver_srv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_srv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_srv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_t),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_t),
            "::",
            stringify!(weight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_t),
            "::",
            stringify!(port)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_srv_name_t {
    pub name: ngx_str_t,
    pub priority: u_short,
    pub weight: u_short,
    pub port: u_short,
    pub ctx: *mut ngx_resolver_ctx_t,
    pub state: ngx_int_t,
    pub naddrs: ngx_uint_t,
    pub addrs: *mut ngx_addr_t,
}
#[test]
fn bindgen_test_layout_ngx_resolver_srv_name_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_srv_name_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_srv_name_t>(),
        56usize,
        concat!("Size of: ", stringify!(ngx_resolver_srv_name_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_srv_name_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_srv_name_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(weight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naddrs) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(naddrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrs) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_srv_name_t),
            "::",
            stringify!(addrs)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngx_resolver_node_t {
    pub node: ngx_rbtree_node_t,
    pub queue: ngx_queue_t,
    pub name: *mut u_char,
    pub addr6: in6_addr,
    pub nlen: u_short,
    pub qlen: u_short,
    pub query: *mut u_char,
    pub query6: *mut u_char,
    pub u: ngx_resolver_node_t__bindgen_ty_1,
    pub code: u_char,
    pub naddrs: u_short,
    pub nsrvs: u_short,
    pub cnlen: u_short,
    pub u6: ngx_resolver_node_t__bindgen_ty_2,
    pub naddrs6: u_short,
    pub expire: time_t,
    pub valid: time_t,
    pub ttl: u32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub last_connection: ngx_uint_t,
    pub waiting: *mut ngx_resolver_ctx_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_resolver_node_t__bindgen_ty_1 {
    pub addr: in_addr_t,
    pub addrs: *mut in_addr_t,
    pub cname: *mut u_char,
    pub srvs: *mut ngx_resolver_srv_t,
}
#[test]
fn bindgen_test_layout_ngx_resolver_node_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_node_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_node_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ngx_resolver_node_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_node_t__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ngx_resolver_node_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_1),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_1),
            "::",
            stringify!(addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_1),
            "::",
            stringify!(cname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srvs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_1),
            "::",
            stringify!(srvs)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ngx_resolver_node_t__bindgen_ty_2 {
    pub addr6: in6_addr,
    pub addrs6: *mut in6_addr,
}
#[test]
fn bindgen_test_layout_ngx_resolver_node_t__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_node_t__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_node_t__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(ngx_resolver_node_t__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_node_t__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ngx_resolver_node_t__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_2),
            "::",
            stringify!(addr6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrs6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t__bindgen_ty_2),
            "::",
            stringify!(addrs6)
        )
    );
}
#[test]
fn bindgen_test_layout_ngx_resolver_node_t() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_node_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_node_t>(),
        184usize,
        concat!("Size of: ", stringify!(ngx_resolver_node_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_node_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_node_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queue) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(addr6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nlen) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(nlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qlen) as usize - ptr as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(qlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).query) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).query6) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(query6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naddrs) as usize - ptr as usize },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(naddrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsrvs) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(nsrvs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cnlen) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(cnlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u6) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(u6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naddrs6) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(naddrs6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expire) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(expire)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ttl) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_connection) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(last_connection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).waiting) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_node_t),
            "::",
            stringify!(waiting)
        )
    );
}
impl ngx_resolver_node_t {
    #[inline]
    pub fn tcp(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tcp(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn tcp6(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tcp6(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        tcp: ::std::os::raw::c_uint,
        tcp6: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let tcp: u32 = unsafe { ::std::mem::transmute(tcp) };
            tcp as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let tcp6: u32 = unsafe { ::std::mem::transmute(tcp6) };
            tcp6 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_s {
    pub event: *mut ngx_event_t,
    pub dummy: *mut ::std::os::raw::c_void,
    pub log: *mut ngx_log_t,
    pub ident: ngx_int_t,
    pub connections: ngx_array_t,
    pub last_connection: ngx_uint_t,
    pub name_rbtree: ngx_rbtree_t,
    pub name_sentinel: ngx_rbtree_node_t,
    pub srv_rbtree: ngx_rbtree_t,
    pub srv_sentinel: ngx_rbtree_node_t,
    pub addr_rbtree: ngx_rbtree_t,
    pub addr_sentinel: ngx_rbtree_node_t,
    pub name_resend_queue: ngx_queue_t,
    pub srv_resend_queue: ngx_queue_t,
    pub addr_resend_queue: ngx_queue_t,
    pub name_expire_queue: ngx_queue_t,
    pub srv_expire_queue: ngx_queue_t,
    pub addr_expire_queue: ngx_queue_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub addr6_rbtree: ngx_rbtree_t,
    pub addr6_sentinel: ngx_rbtree_node_t,
    pub addr6_resend_queue: ngx_queue_t,
    pub addr6_expire_queue: ngx_queue_t,
    pub resend_timeout: time_t,
    pub tcp_timeout: time_t,
    pub expire: time_t,
    pub valid: time_t,
    pub log_level: ngx_uint_t,
}
#[test]
fn bindgen_test_layout_ngx_resolver_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_s>(),
        512usize,
        concat!("Size of: ", stringify!(ngx_resolver_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ident) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(ident)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connections) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(connections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_connection) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(last_connection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_rbtree) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(name_rbtree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_sentinel) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(name_sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv_rbtree) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(srv_rbtree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv_sentinel) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(srv_sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_rbtree) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr_rbtree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_sentinel) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr_sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_resend_queue) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(name_resend_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv_resend_queue) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(srv_resend_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_resend_queue) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr_resend_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_expire_queue) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(name_expire_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv_expire_queue) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(srv_expire_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_expire_queue) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr_expire_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6_rbtree) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr6_rbtree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6_sentinel) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr6_sentinel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6_resend_queue) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr6_resend_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr6_expire_queue) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(addr6_expire_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resend_timeout) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(resend_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tcp_timeout) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(tcp_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expire) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(expire)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_level) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_s),
            "::",
            stringify!(log_level)
        )
    );
}
impl ngx_resolver_s {
    #[inline]
    pub fn ipv4(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ipv4(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ipv6(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ipv6(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ipv4: ::std::os::raw::c_uint,
        ipv6: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ipv4: u32 = unsafe { ::std::mem::transmute(ipv4) };
            ipv4 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ipv6: u32 = unsafe { ::std::mem::transmute(ipv6) };
            ipv6 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_resolver_ctx_s {
    pub next: *mut ngx_resolver_ctx_t,
    pub resolver: *mut ngx_resolver_t,
    pub node: *mut ngx_resolver_node_t,
    pub ident: ngx_int_t,
    pub state: ngx_int_t,
    pub name: ngx_str_t,
    pub service: ngx_str_t,
    pub valid: time_t,
    pub naddrs: ngx_uint_t,
    pub addrs: *mut ngx_resolver_addr_t,
    pub addr: ngx_resolver_addr_t,
    pub sin: sockaddr_in,
    pub count: ngx_uint_t,
    pub nsrvs: ngx_uint_t,
    pub srvs: *mut ngx_resolver_srv_name_t,
    pub handler: ngx_resolver_handler_pt,
    pub data: *mut ::std::os::raw::c_void,
    pub timeout: ngx_msec_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub recursion: ngx_uint_t,
    pub event: *mut ngx_event_t,
}
#[test]
fn bindgen_test_layout_ngx_resolver_ctx_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_resolver_ctx_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_resolver_ctx_s>(),
        224usize,
        concat!("Size of: ", stringify!(ngx_resolver_ctx_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_resolver_ctx_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_resolver_ctx_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolver) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(resolver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ident) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(ident)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).service) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(service)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valid) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).naddrs) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(naddrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrs) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(addrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(sin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsrvs) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(nsrvs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srvs) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(srvs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recursion) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(recursion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_resolver_ctx_s),
            "::",
            stringify!(event)
        )
    );
}
impl ngx_resolver_ctx_s {
    #[inline]
    pub fn quick(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quick(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn async_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_async(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cancelable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cancelable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        quick: ::std::os::raw::c_uint,
        async_: ::std::os::raw::c_uint,
        cancelable: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let quick: u32 = unsafe { ::std::mem::transmute(quick) };
            quick as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let async_: u32 = unsafe { ::std::mem::transmute(async_) };
            async_ as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let cancelable: u32 = unsafe { ::std::mem::transmute(cancelable) };
            cancelable as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ngx_resolver_create(
        cf: *mut ngx_conf_t,
        names: *mut ngx_str_t,
        n: ngx_uint_t,
    ) -> *mut ngx_resolver_t;
}
extern "C" {
    pub fn ngx_resolve_start(
        r: *mut ngx_resolver_t,
        temp: *mut ngx_resolver_ctx_t,
    ) -> *mut ngx_resolver_ctx_t;
}
extern "C" {
    pub fn ngx_resolve_name(ctx: *mut ngx_resolver_ctx_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_resolve_name_done(ctx: *mut ngx_resolver_ctx_t);
}
extern "C" {
    pub fn ngx_resolve_addr(ctx: *mut ngx_resolver_ctx_t) -> ngx_int_t;
}
extern "C" {
    pub fn ngx_resolve_addr_done(ctx: *mut ngx_resolver_ctx_t);
}
extern "C" {
    pub fn ngx_resolver_strerror(err: ngx_int_t) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_st {
    _unused: [u8; 0],
}
pub type SSL = ssl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_ctx_st {
    _unused: [u8; 0],
}
pub type SSL_CTX = ssl_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_session_st {
    _unused: [u8; 0],
}
pub type SSL_SESSION = ssl_session_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ssl_ocsp_s {
    _unused: [u8; 0],
}
pub type ngx_ssl_ocsp_t = ngx_ssl_ocsp_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ssl_s {
    pub ctx: *mut SSL_CTX,
    pub log: *mut ngx_log_t,
    pub buffer_size: usize,
}
#[test]
fn bindgen_test_layout_ngx_ssl_s() {
    const UNINIT: ::std::mem::MaybeUninit<ngx_ssl_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ngx_ssl_s>(),
        24usize,
        concat!("Size of: ", stringify!(ngx_ssl_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ngx_ssl_s>(),
        8usize,
        concat!("Alignment of ", stringify!(ngx_ssl_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ssl_s),
            "::",
            stringify!(ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ssl_s),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ngx_ssl_s),
            "::",
            stringify!(buffer_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngx_ssl_connection_s {
    pub connection: *mut SSL,
    pub session_ctx: *mut SSL_CTX,
    pub last: ngx_int_t,
    pub buf: *mut ngx_buf_t,
    pub buffer_size: usize,
    pub handler: ngx_connection_handler_pt,
    pub session: *mut SSL_SESSION,
    pub save_session: ngx_connection_handler_pt,
    pub saved_read_handler: ngx_event_handler_pt,
    pub saved_write_handler: ngx_event_handler_pt,
    pub ocsp: *mut ngx_ssl_ocsp_t,
    pub early_buf: u_char,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
